mermaid archi
